out/dependency-topology.mmd
flowchart LR
    src_openEuler_cdma["src-openEuler-cdma"]
    src_openEuler_libvirt["src-openEuler-libvirt"]
    src_openEuler_memlink["src-openEuler-memlink"]
    src_openEuler_obmm["src-openEuler-obmm"]
    src_openEuler_qemu["src-openEuler-qemu"]
    src_openEuler_sysSentry["src-openEuler-sysSentry"]
    src_openEuler_ubctl["src-openEuler-ubctl"]
    src_openEuler_ubs_comm["src-openEuler-ubs-comm"]
    src_openEuler_ubs_engine["src-openEuler-ubs-engine"]
    src_openEuler_ubs_mem["src-openEuler-ubs-mem"]
    src_openEuler_ubturbo["src-openEuler-ubturbo"]
    src_openEuler_ubutils["src-openEuler-ubutils"]
    src_openEuler_umdk["src-openEuler-umdk"]
    src_openEuler_ummu["src-openEuler-ummu"]
    src_openEuler_cdma -->|libummu| src_openEuler_ummu
    src_openEuler_libvirt -->|qemu| src_openEuler_qemu
    src_openEuler_libvirt -->|qemu-img| src_openEuler_qemu
    src_openEuler_libvirt -->|qemu-kvm| src_openEuler_qemu
    src_openEuler_memlink -->|libvirt| src_openEuler_libvirt
    src_openEuler_sysSentry -->|libobmm| src_openEuler_obmm
    src_openEuler_ubs_engine -->|libobmm| src_openEuler_obmm
    src_openEuler_ubs_engine -->|ubs-comm-lib| src_openEuler_ubs_comm
    src_openEuler_ubs_mem -->|ubs-comm-lib| src_openEuler_ubs_comm
    src_openEuler_ubs_mem -->|ubs-engine| src_openEuler_ubs_engine
    src_openEuler_ubs_mem -->|ubs-engine-client-libs| src_openEuler_ubs_engine
    src_openEuler_umdk -->|libummu| src_openEuler_ummu
